; ModuleID = 'llvm-link'
source_filename = "llvm-link"
target datalayout = "e-m:e-i8:8:32-i16:16:32-i64:64-i128:128-n32:64-S128"
target triple = "aarch64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.t_vhost = type { [255 x i8], [255 x i8], [255 x i8], [255 x i8], [255 x i8] }
%struct.sockaddr_in = type { i16, i16, %struct.in_addr, [8 x i8] }
%struct.in_addr = type { i32 }
%struct.timeval = type { i64, i64 }
%struct.fd_set = type { [16 x i64] }
%struct.passwd = type { i8*, i8*, i32, i32, i8*, i8*, i8* }
%struct.sockaddr = type { i16, [14 x i8] }
%struct.dirent = type { i64, i64, i16, i8, [256 x i8] }
%struct.stat = type { i64, i64, i32, i32, i32, i32, i64, i64, i64, i32, i32, i64, %struct.timeval, %struct.timeval, %struct.timeval, [2 x i32] }
%struct.tm = type opaque
%"struct.std::__va_list" = type { i8*, i8*, i8*, i32, i32 }

@.str = private unnamed_addr constant [25 x i8] c"/usr/local/ghttpd/htdocs\00", align 1
@.str.1 = private unnamed_addr constant [11 x i8] c"index.html\00", align 1
@.str.2 = private unnamed_addr constant [9 x i8] c"/cgi-bin\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "assocNames", scope: !2, file: !3, line: 305, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 13.0.1-2ubuntu2.2", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !20, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "protocol.c", directory: "/root/DOPExploit/MyDOP/benchmarks/ghttpd-1.4")
!4 = !{}
!5 = !{!6, !7}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !9, line: 180, size: 128, elements: !10)
!9 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/socket.h", directory: "")
!10 = !{!11, !15}
!11 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !8, file: !9, line: 182, baseType: !12, size: 16)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "sa_family_t", file: !13, line: 28, baseType: !14)
!13 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/sockaddr.h", directory: "")
!14 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !8, file: !9, line: 183, baseType: !16, size: 112, offset: 16)
!16 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 112, elements: !18)
!17 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!18 = !{!19}
!19 = !DISubrange(count: 14)
!20 = !{!0}
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 51200, elements: !22)
!22 = !{!23, !24, !25}
!23 = !DISubrange(count: 32)
!24 = !DISubrange(count: 2)
!25 = !DISubrange(count: 100)
!26 = !DIGlobalVariableExpression(var: !27, expr: !DIExpression())
!27 = distinct !DIGlobalVariable(name: "vhosts", scope: !28, file: !29, line: 42, type: !31, isLocal: false, isDefinition: true)
!28 = distinct !DICompileUnit(language: DW_LANG_C99, file: !29, producer: "Ubuntu clang version 13.0.1-2ubuntu2.2", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !30, globals: !50, splitDebugInlining: false, nameTableKind: None)
!29 = !DIFile(filename: "main.c", directory: "/root/DOPExploit/MyDOP/benchmarks/ghttpd-1.4")
!30 = !{!31, !44, !6, !49}
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_vhost", file: !33, line: 30, baseType: !34)
!33 = !DIFile(filename: "./ghttpd.h", directory: "/root/DOPExploit/MyDOP/benchmarks/ghttpd-1.4")
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !33, line: 23, size: 10200, elements: !35)
!35 = !{!36, !40, !41, !42, !43}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !34, file: !33, line: 25, baseType: !37, size: 2040)
!37 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 2040, elements: !38)
!38 = !{!39}
!39 = !DISubrange(count: 255)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "DOCUMENTROOT", scope: !34, file: !33, line: 26, baseType: !37, size: 2040, offset: 2040)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "DEFAULTPAGE", scope: !34, file: !33, line: 27, baseType: !37, size: 2040, offset: 4080)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "CGIBINDIR", scope: !34, file: !33, line: 28, baseType: !37, size: 2040, offset: 6120)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "CGIBINROOT", scope: !34, file: !33, line: 29, baseType: !37, size: 2040, offset: 8160)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", file: !9, line: 180, size: 128, elements: !46)
!46 = !{!47, !48}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !45, file: !9, line: 182, baseType: !12, size: 16)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !45, file: !9, line: 183, baseType: !16, size: 112, offset: 16)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!50 = !{!51, !26, !54, !57, !59, !61}
!51 = !DIGlobalVariableExpression(var: !52, expr: !DIExpression())
!52 = distinct !DIGlobalVariable(name: "no_vhosts", scope: !28, file: !29, line: 41, type: !53, isLocal: false, isDefinition: true)
!53 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!54 = !DIGlobalVariableExpression(var: !55, expr: !DIExpression())
!55 = distinct !DIGlobalVariable(name: "SERVERPORT", scope: !28, file: !29, line: 44, type: !56, isLocal: false, isDefinition: true)
!56 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!57 = !DIGlobalVariableExpression(var: !58, expr: !DIExpression())
!58 = distinct !DIGlobalVariable(name: "SERVERTYPE", scope: !28, file: !29, line: 45, type: !37, isLocal: false, isDefinition: true)
!59 = !DIGlobalVariableExpression(var: !60, expr: !DIExpression())
!60 = distinct !DIGlobalVariable(name: "SERVERROOT", scope: !28, file: !29, line: 46, type: !37, isLocal: false, isDefinition: true)
!61 = !DIGlobalVariableExpression(var: !62, expr: !DIExpression())
!62 = distinct !DIGlobalVariable(name: "defaulthost", scope: !28, file: !29, line: 48, type: !32, isLocal: false, isDefinition: true)
!63 = distinct !DICompileUnit(language: DW_LANG_C99, file: !64, producer: "Ubuntu clang version 13.0.1-2ubuntu2.2", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !65, splitDebugInlining: false, nameTableKind: None)
!64 = !DIFile(filename: "util.c", directory: "/root/DOPExploit/MyDOP/benchmarks/ghttpd-1.4")
!65 = !{!6}
!66 = !{!"Ubuntu clang version 13.0.1-2ubuntu2.2"}
!67 = !{i32 7, !"Dwarf Version", i32 4}
!68 = !{i32 2, !"Debug Info Version", i32 3}
!69 = !{i32 1, !"wchar_size", i32 4}
!70 = !{i32 1, !"branch-target-enforcement", i32 0}
!71 = !{i32 1, !"sign-return-address", i32 0}
!72 = !{i32 1, !"sign-return-address-all", i32 0}
!73 = !{i32 1, !"sign-return-address-with-bkey", i32 0}
!74 = !{i32 7, !"uwtable", i32 1}
!75 = !{i32 7, !"frame-pointer", i32 1}
!76 = distinct !DISubprogram(name: "main", scope: !29, file: !29, line: 50, type: !77, scopeLine: 51, spFlags: DISPFlagDefinition, unit: !28, retainedNodes: !4)
!77 = !DISubroutineType(types: !78)
!78 = !{!79}
!79 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!80 = !DILocalVariable(name: "xx", scope: !76, file: !29, line: 52, type: !79)
!81 = !DILocation(line: 52, column: 6, scope: !76)
!82 = !DILocalVariable(name: "sockfd", scope: !76, file: !29, line: 52, type: !79)
!83 = !DILocation(line: 52, column: 12, scope: !76)
!84 = !DILocalVariable(name: "new_fd", scope: !76, file: !29, line: 52, type: !79)
!85 = !DILocation(line: 52, column: 20, scope: !76)
!86 = !DILocalVariable(name: "numbytes", scope: !76, file: !29, line: 52, type: !79)
!87 = !DILocation(line: 52, column: 28, scope: !76)
!88 = !DILocalVariable(name: "my_addr", scope: !76, file: !29, line: 53, type: !89)
!89 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !90, line: 245, size: 128, elements: !91)
!90 = !DIFile(filename: "/usr/include/netinet/in.h", directory: "")
!91 = !{!92, !93, !99, !106}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !89, file: !90, line: 247, baseType: !12, size: 16)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !89, file: !90, line: 248, baseType: !94, size: 16, offset: 16)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_port_t", file: !90, line: 123, baseType: !95)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !96, line: 25, baseType: !97)
!96 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/stdint-uintn.h", directory: "")
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !98, line: 40, baseType: !14)
!98 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types.h", directory: "")
!99 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !89, file: !90, line: 249, baseType: !100, size: 32, offset: 32)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !90, line: 31, size: 32, elements: !101)
!101 = !{!102}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !100, file: !90, line: 33, baseType: !103, size: 32)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "in_addr_t", file: !90, line: 30, baseType: !104)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !96, line: 26, baseType: !105)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !98, line: 42, baseType: !56)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !89, file: !90, line: 252, baseType: !107, size: 64, offset: 64)
!107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 64, elements: !109)
!108 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!109 = !{!110}
!110 = !DISubrange(count: 8)
!111 = !DILocation(line: 53, column: 21, scope: !76)
!112 = !DILocalVariable(name: "their_addr", scope: !76, file: !29, line: 54, type: !89)
!113 = !DILocation(line: 54, column: 21, scope: !76)
!114 = !DILocalVariable(name: "sin_size", scope: !76, file: !29, line: 55, type: !79)
!115 = !DILocation(line: 55, column: 6, scope: !76)
!116 = !DILocalVariable(name: "i", scope: !76, file: !29, line: 55, type: !79)
!117 = !DILocation(line: 55, column: 16, scope: !76)
!118 = !DILocalVariable(name: "tv", scope: !76, file: !29, line: 56, type: !119)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !120, line: 8, size: 128, elements: !121)
!120 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_timeval.h", directory: "")
!121 = !{!122, !125}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !119, file: !120, line: 14, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !98, line: 160, baseType: !124)
!124 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !119, file: !120, line: 15, baseType: !126, size: 64, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !98, line: 162, baseType: !124)
!127 = !DILocation(line: 56, column: 17, scope: !76)
!128 = !DILocalVariable(name: "readfds", scope: !76, file: !29, line: 57, type: !129)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "fd_set", file: !130, line: 70, baseType: !131)
!130 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/sys/select.h", directory: "")
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !130, line: 59, size: 1024, elements: !132)
!132 = !{!133}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "__fds_bits", scope: !131, file: !130, line: 67, baseType: !134, size: 1024)
!134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !135, size: 1024, elements: !136)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "__fd_mask", file: !130, line: 49, baseType: !124)
!136 = !{!137}
!137 = !DISubrange(count: 16)
!138 = !DILocation(line: 57, column: 9, scope: !76)
!139 = !DILocalVariable(name: "exceptfds", scope: !76, file: !29, line: 57, type: !129)
!140 = !DILocation(line: 57, column: 18, scope: !76)
!141 = !DILocalVariable(name: "pw", scope: !76, file: !29, line: 58, type: !142)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "passwd", file: !144, line: 49, size: 384, elements: !145)
!144 = !DIFile(filename: "/usr/include/pwd.h", directory: "")
!145 = !{!146, !147, !148, !150, !152, !153, !154}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "pw_name", scope: !143, file: !144, line: 51, baseType: !49, size: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "pw_passwd", scope: !143, file: !144, line: 52, baseType: !49, size: 64, offset: 64)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "pw_uid", scope: !143, file: !144, line: 54, baseType: !149, size: 32, offset: 128)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !98, line: 146, baseType: !56)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gid", scope: !143, file: !144, line: 55, baseType: !151, size: 32, offset: 160)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !98, line: 147, baseType: !56)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gecos", scope: !143, file: !144, line: 56, baseType: !49, size: 64, offset: 192)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "pw_dir", scope: !143, file: !144, line: 57, baseType: !49, size: 64, offset: 256)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "pw_shell", scope: !143, file: !144, line: 58, baseType: !49, size: 64, offset: 320)
!155 = !DILocation(line: 58, column: 17, scope: !76)
!156 = !DILocation(line: 64, column: 2, scope: !76)
!157 = !DILocation(line: 65, column: 2, scope: !76)
!158 = !DILocation(line: 66, column: 2, scope: !76)
!159 = !DILocation(line: 67, column: 2, scope: !76)
!160 = !DILocation(line: 73, column: 14, scope: !76)
!161 = !DILocation(line: 73, column: 12, scope: !76)
!162 = !DILocation(line: 74, column: 30, scope: !76)
!163 = !DILocation(line: 74, column: 39, scope: !76)
!164 = !DILocation(line: 74, column: 43, scope: !76)
!165 = !DILocation(line: 74, column: 22, scope: !76)
!166 = !DILocation(line: 74, column: 11, scope: !76)
!167 = !DILocation(line: 74, column: 9, scope: !76)
!168 = !DILocation(line: 143, column: 56, scope: !76)
!169 = !DILocation(line: 143, column: 2, scope: !76)
!170 = !DILocation(line: 145, column: 2, scope: !76)
!171 = !DILocation(line: 153, column: 2, scope: !76)
!172 = !DILocation(line: 158, column: 28, scope: !173)
!173 = distinct !DILexicalBlock(scope: !174, file: !29, line: 158, column: 12)
!174 = distinct !DILexicalBlock(scope: !76, file: !29, line: 153, column: 11)
!175 = !DILocation(line: 158, column: 12, scope: !173)
!176 = !DILocation(line: 158, column: 35, scope: !173)
!177 = !DILocation(line: 158, column: 12, scope: !174)
!178 = !DILocation(line: 158, column: 41, scope: !173)
!179 = !DILocation(line: 188, column: 9, scope: !174)
!180 = !DILocation(line: 188, column: 3, scope: !174)
!181 = distinct !{!181, !171, !182}
!182 = !DILocation(line: 191, column: 2, scope: !76)
!183 = !DILocation(line: 193, column: 2, scope: !76)
!184 = distinct !DISubprogram(name: "inetd_server", scope: !29, file: !29, line: 200, type: !77, scopeLine: 201, spFlags: DISPFlagDefinition, unit: !28, retainedNodes: !4)
!185 = !DILocalVariable(name: "their_addr", scope: !184, file: !29, line: 202, type: !89)
!186 = !DILocation(line: 202, column: 22, scope: !184)
!187 = !DILocalVariable(name: "sval", scope: !184, file: !29, line: 203, type: !188)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !189, line: 46, baseType: !53)
!189 = !DIFile(filename: "/usr/lib/llvm-13/lib/clang/13.0.1/include/stddef.h", directory: "")
!190 = !DILocation(line: 203, column: 10, scope: !184)
!191 = !DILocalVariable(name: "pw", scope: !184, file: !29, line: 204, type: !142)
!192 = !DILocation(line: 204, column: 18, scope: !184)
!193 = !DILocation(line: 207, column: 22, scope: !194)
!194 = distinct !DILexicalBlock(scope: !184, file: !29, line: 207, column: 7)
!195 = !DILocation(line: 207, column: 55, scope: !194)
!196 = !DILocation(line: 207, column: 7, scope: !194)
!197 = !DILocation(line: 207, column: 62, scope: !194)
!198 = !DILocation(line: 207, column: 7, scope: !184)
!199 = !DILocation(line: 208, column: 3, scope: !200)
!200 = distinct !DILexicalBlock(scope: !194, file: !29, line: 207, column: 67)
!201 = !DILocation(line: 212, column: 13, scope: !202)
!202 = distinct !DILexicalBlock(scope: !184, file: !29, line: 212, column: 7)
!203 = !DILocation(line: 212, column: 11, scope: !202)
!204 = !DILocation(line: 212, column: 33, scope: !202)
!205 = !DILocation(line: 212, column: 7, scope: !184)
!206 = !DILocation(line: 213, column: 10, scope: !207)
!207 = distinct !DILexicalBlock(scope: !202, file: !29, line: 212, column: 42)
!208 = !DILocation(line: 213, column: 14, scope: !207)
!209 = !DILocation(line: 213, column: 3, scope: !207)
!210 = !DILocation(line: 214, column: 10, scope: !207)
!211 = !DILocation(line: 214, column: 14, scope: !207)
!212 = !DILocation(line: 214, column: 3, scope: !207)
!213 = !DILocation(line: 215, column: 3, scope: !207)
!214 = !DILocation(line: 217, column: 50, scope: !184)
!215 = !DILocation(line: 217, column: 29, scope: !184)
!216 = !DILocation(line: 217, column: 3, scope: !184)
!217 = !DILocation(line: 218, column: 54, scope: !184)
!218 = !DILocation(line: 218, column: 33, scope: !184)
!219 = !DILocation(line: 218, column: 25, scope: !184)
!220 = !DILocation(line: 218, column: 3, scope: !184)
!221 = !DILocation(line: 220, column: 3, scope: !184)
!222 = !DILocation(line: 222, column: 3, scope: !184)
!223 = distinct !DISubprogram(name: "signal_handler", scope: !29, file: !29, line: 225, type: !224, scopeLine: 226, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !28, retainedNodes: !4)
!224 = !DISubroutineType(types: !225)
!225 = !{null, !79}
!226 = !DILocalVariable(name: "signum", arg: 1, scope: !223, file: !29, line: 225, type: !79)
!227 = !DILocation(line: 225, column: 25, scope: !223)
!228 = !DILocation(line: 227, column: 5, scope: !229)
!229 = distinct !DILexicalBlock(scope: !223, file: !29, line: 227, column: 5)
!230 = !DILocation(line: 227, column: 12, scope: !229)
!231 = !DILocation(line: 227, column: 5, scope: !223)
!232 = !DILocation(line: 229, column: 3, scope: !233)
!233 = distinct !DILexicalBlock(scope: !229, file: !29, line: 228, column: 2)
!234 = !DILocation(line: 229, column: 9, scope: !233)
!235 = !DILocation(line: 229, column: 34, scope: !233)
!236 = distinct !{!236, !232, !237, !238}
!237 = !DILocation(line: 229, column: 38, scope: !233)
!238 = !{!"llvm.loop.mustprogress"}
!239 = !DILocation(line: 230, column: 2, scope: !233)
!240 = !DILocation(line: 231, column: 10, scope: !241)
!241 = distinct !DILexicalBlock(scope: !229, file: !29, line: 231, column: 10)
!242 = !DILocation(line: 231, column: 17, scope: !241)
!243 = !DILocation(line: 231, column: 10, scope: !229)
!244 = !DILocation(line: 232, column: 3, scope: !241)
!245 = !DILocation(line: 235, column: 3, scope: !246)
!246 = distinct !DILexicalBlock(scope: !241, file: !29, line: 234, column: 2)
!247 = !DILocation(line: 235, column: 9, scope: !246)
!248 = !DILocation(line: 235, column: 34, scope: !246)
!249 = distinct !{!249, !245, !250, !238}
!250 = !DILocation(line: 235, column: 38, scope: !246)
!251 = !DILocation(line: 236, column: 3, scope: !246)
!252 = !DILocation(line: 238, column: 1, scope: !223)
!253 = distinct !DISubprogram(name: "serveconnection", scope: !3, file: !3, line: 38, type: !254, scopeLine: 39, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!254 = !DISubroutineType(types: !255)
!255 = !{!79, !79}
!256 = !DILocalVariable(name: "sockfd", arg: 1, scope: !253, file: !3, line: 38, type: !79)
!257 = !DILocation(line: 38, column: 25, scope: !253)
!258 = !DILocalVariable(name: "in", scope: !253, file: !3, line: 40, type: !259)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !261, line: 7, baseType: !262)
!261 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/FILE.h", directory: "")
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !263, line: 49, size: 1728, elements: !264)
!263 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!264 = !{!265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !280, !282, !283, !284, !286, !287, !289, !293, !296, !298, !301, !304, !305, !306, !307, !308}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !262, file: !263, line: 51, baseType: !79, size: 32)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !262, file: !263, line: 54, baseType: !49, size: 64, offset: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !262, file: !263, line: 55, baseType: !49, size: 64, offset: 128)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !262, file: !263, line: 56, baseType: !49, size: 64, offset: 192)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !262, file: !263, line: 57, baseType: !49, size: 64, offset: 256)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !262, file: !263, line: 58, baseType: !49, size: 64, offset: 320)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !262, file: !263, line: 59, baseType: !49, size: 64, offset: 384)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !262, file: !263, line: 60, baseType: !49, size: 64, offset: 448)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !262, file: !263, line: 61, baseType: !49, size: 64, offset: 512)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !262, file: !263, line: 64, baseType: !49, size: 64, offset: 576)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !262, file: !263, line: 65, baseType: !49, size: 64, offset: 640)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !262, file: !263, line: 66, baseType: !49, size: 64, offset: 704)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !262, file: !263, line: 68, baseType: !278, size: 64, offset: 768)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!279 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !263, line: 36, flags: DIFlagFwdDecl)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !262, file: !263, line: 70, baseType: !281, size: 64, offset: 832)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !262, file: !263, line: 72, baseType: !79, size: 32, offset: 896)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !262, file: !263, line: 73, baseType: !79, size: 32, offset: 928)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !262, file: !263, line: 74, baseType: !285, size: 64, offset: 960)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !98, line: 152, baseType: !124)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !262, file: !263, line: 77, baseType: !14, size: 16, offset: 1024)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !262, file: !263, line: 78, baseType: !288, size: 8, offset: 1040)
!288 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !262, file: !263, line: 79, baseType: !290, size: 8, offset: 1048)
!290 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 8, elements: !291)
!291 = !{!292}
!292 = !DISubrange(count: 1)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !262, file: !263, line: 81, baseType: !294, size: 64, offset: 1088)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !263, line: 43, baseType: null)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !262, file: !263, line: 89, baseType: !297, size: 64, offset: 1152)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !98, line: 153, baseType: !124)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !262, file: !263, line: 91, baseType: !299, size: 64, offset: 1216)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !263, line: 37, flags: DIFlagFwdDecl)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !262, file: !263, line: 92, baseType: !302, size: 64, offset: 1280)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !263, line: 38, flags: DIFlagFwdDecl)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !262, file: !263, line: 93, baseType: !281, size: 64, offset: 1344)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !262, file: !263, line: 94, baseType: !6, size: 64, offset: 1408)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !262, file: !263, line: 95, baseType: !188, size: 64, offset: 1472)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !262, file: !263, line: 96, baseType: !79, size: 32, offset: 1536)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !262, file: !263, line: 98, baseType: !309, size: 160, offset: 1568)
!309 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 160, elements: !310)
!310 = !{!311}
!311 = !DISubrange(count: 20)
!312 = !DILocation(line: 40, column: 8, scope: !253)
!313 = !DILocalVariable(name: "tempdata", scope: !253, file: !3, line: 41, type: !314)
!314 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 65536, elements: !315)
!315 = !{!316}
!316 = !DISubrange(count: 8192)
!317 = !DILocation(line: 41, column: 7, scope: !253)
!318 = !DILocalVariable(name: "ptr", scope: !253, file: !3, line: 41, type: !49)
!319 = !DILocation(line: 41, column: 24, scope: !253)
!320 = !DILocalVariable(name: "ptr2", scope: !253, file: !3, line: 41, type: !49)
!321 = !DILocation(line: 41, column: 30, scope: !253)
!322 = !DILocalVariable(name: "host_ptr1", scope: !253, file: !3, line: 41, type: !49)
!323 = !DILocation(line: 41, column: 37, scope: !253)
!324 = !DILocalVariable(name: "host_ptr2", scope: !253, file: !3, line: 41, type: !49)
!325 = !DILocation(line: 41, column: 49, scope: !253)
!326 = !DILocalVariable(name: "tempstring", scope: !253, file: !3, line: 42, type: !314)
!327 = !DILocation(line: 42, column: 7, scope: !253)
!328 = !DILocalVariable(name: "mimetype", scope: !253, file: !3, line: 42, type: !329)
!329 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 400, elements: !330)
!330 = !{!331}
!331 = !DISubrange(count: 50)
!332 = !DILocation(line: 42, column: 25, scope: !253)
!333 = !DILocalVariable(name: "filename", scope: !253, file: !3, line: 43, type: !37)
!334 = !DILocation(line: 43, column: 7, scope: !253)
!335 = !DILocalVariable(name: "loop", scope: !253, file: !3, line: 44, type: !56)
!336 = !DILocation(line: 44, column: 15, scope: !253)
!337 = !DILocalVariable(name: "flag", scope: !253, file: !3, line: 44, type: !56)
!338 = !DILocation(line: 44, column: 23, scope: !253)
!339 = !DILocalVariable(name: "numbytes", scope: !253, file: !3, line: 45, type: !79)
!340 = !DILocation(line: 45, column: 6, scope: !253)
!341 = !DILocalVariable(name: "sa", scope: !253, file: !3, line: 46, type: !342)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", file: !90, line: 245, size: 128, elements: !343)
!343 = !{!344, !345, !346, !350}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !342, file: !90, line: 247, baseType: !12, size: 16)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !342, file: !90, line: 248, baseType: !94, size: 16, offset: 16)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !342, file: !90, line: 249, baseType: !347, size: 32, offset: 32)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", file: !90, line: 31, size: 32, elements: !348)
!348 = !{!349}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !347, file: !90, line: 33, baseType: !103, size: 32)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !342, file: !90, line: 252, baseType: !107, size: 64, offset: 64)
!351 = !DILocation(line: 46, column: 21, scope: !253)
!352 = !DILocalVariable(name: "addrlen", scope: !253, file: !3, line: 47, type: !79)
!353 = !DILocation(line: 47, column: 6, scope: !253)
!354 = !DILocalVariable(name: "thehost", scope: !253, file: !3, line: 48, type: !355)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_vhost", file: !33, line: 30, baseType: !357)
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !33, line: 23, size: 10200, elements: !358)
!358 = !{!359, !360, !361, !362, !363}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !357, file: !33, line: 25, baseType: !37, size: 2040)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "DOCUMENTROOT", scope: !357, file: !33, line: 26, baseType: !37, size: 2040, offset: 2040)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "DEFAULTPAGE", scope: !357, file: !33, line: 27, baseType: !37, size: 2040, offset: 4080)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "CGIBINDIR", scope: !357, file: !33, line: 28, baseType: !37, size: 2040, offset: 6120)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "CGIBINROOT", scope: !357, file: !33, line: 29, baseType: !37, size: 2040, offset: 8160)
!364 = !DILocation(line: 48, column: 11, scope: !253)
!365 = !DILocation(line: 50, column: 21, scope: !253)
!366 = !DILocation(line: 50, column: 2, scope: !253)
!367 = !DILocation(line: 51, column: 21, scope: !253)
!368 = !DILocation(line: 51, column: 2, scope: !253)
!369 = !DILocation(line: 52, column: 21, scope: !253)
!370 = !DILocation(line: 52, column: 2, scope: !253)
!371 = !DILocation(line: 53, column: 21, scope: !253)
!372 = !DILocation(line: 53, column: 2, scope: !253)
!373 = !DILocation(line: 54, column: 21, scope: !253)
!374 = !DILocation(line: 54, column: 2, scope: !253)
!375 = !DILocation(line: 55, column: 21, scope: !253)
!376 = !DILocation(line: 55, column: 2, scope: !253)
!377 = !DILocation(line: 56, column: 21, scope: !253)
!378 = !DILocation(line: 56, column: 2, scope: !253)
!379 = !DILocation(line: 57, column: 21, scope: !253)
!380 = !DILocation(line: 57, column: 2, scope: !253)
!381 = !DILocation(line: 58, column: 21, scope: !253)
!382 = !DILocation(line: 58, column: 2, scope: !253)
!383 = !DILocation(line: 60, column: 24, scope: !253)
!384 = !DILocation(line: 60, column: 5, scope: !253)
!385 = !DILocation(line: 61, column: 24, scope: !253)
!386 = !DILocation(line: 61, column: 5, scope: !253)
!387 = !DILocation(line: 62, column: 24, scope: !253)
!388 = !DILocation(line: 62, column: 5, scope: !253)
!389 = !DILocation(line: 63, column: 24, scope: !253)
!390 = !DILocation(line: 63, column: 5, scope: !253)
!391 = !DILocation(line: 64, column: 24, scope: !253)
!392 = !DILocation(line: 64, column: 5, scope: !253)
!393 = !DILocation(line: 65, column: 24, scope: !253)
!394 = !DILocation(line: 65, column: 5, scope: !253)
!395 = !DILocation(line: 67, column: 10, scope: !253)
!396 = !DILocation(line: 91, column: 5, scope: !397)
!397 = distinct !DILexicalBlock(scope: !253, file: !3, line: 91, column: 5)
!398 = !DILocation(line: 91, column: 9, scope: !397)
!399 = !DILocation(line: 91, column: 5, scope: !253)
!400 = !DILocation(line: 93, column: 10, scope: !401)
!401 = distinct !DILexicalBlock(scope: !397, file: !3, line: 92, column: 2)
!402 = !DILocation(line: 93, column: 3, scope: !401)
!403 = !DILocation(line: 94, column: 10, scope: !401)
!404 = !DILocation(line: 94, column: 3, scope: !401)
!405 = !DILocation(line: 95, column: 3, scope: !401)
!406 = !DILocation(line: 98, column: 21, scope: !253)
!407 = !DILocation(line: 98, column: 14, scope: !253)
!408 = !DILocation(line: 98, column: 12, scope: !253)
!409 = !DILocation(line: 99, column: 5, scope: !410)
!410 = distinct !DILexicalBlock(scope: !253, file: !3, line: 99, column: 5)
!411 = !DILocation(line: 99, column: 5, scope: !253)
!412 = !DILocation(line: 101, column: 22, scope: !413)
!413 = distinct !DILexicalBlock(scope: !410, file: !3, line: 100, column: 2)
!414 = !DILocation(line: 101, column: 31, scope: !413)
!415 = !DILocation(line: 101, column: 15, scope: !413)
!416 = !DILocation(line: 101, column: 13, scope: !413)
!417 = !DILocation(line: 103, column: 11, scope: !418)
!418 = distinct !DILexicalBlock(scope: !413, file: !3, line: 103, column: 3)
!419 = !DILocation(line: 103, column: 7, scope: !418)
!420 = !DILocation(line: 103, column: 15, scope: !421)
!421 = distinct !DILexicalBlock(scope: !418, file: !3, line: 103, column: 3)
!422 = !DILocation(line: 103, column: 20, scope: !421)
!423 = !DILocation(line: 103, column: 19, scope: !421)
!424 = !DILocation(line: 103, column: 3, scope: !418)
!425 = !DILocation(line: 104, column: 17, scope: !426)
!426 = distinct !DILexicalBlock(scope: !421, file: !3, line: 104, column: 7)
!427 = !DILocation(line: 104, column: 24, scope: !426)
!428 = !DILocation(line: 104, column: 30, scope: !426)
!429 = !DILocation(line: 104, column: 36, scope: !426)
!430 = !DILocation(line: 104, column: 8, scope: !426)
!431 = !DILocation(line: 104, column: 7, scope: !421)
!432 = !DILocation(line: 105, column: 16, scope: !426)
!433 = !DILocation(line: 105, column: 23, scope: !426)
!434 = !DILocation(line: 105, column: 13, scope: !426)
!435 = !DILocation(line: 105, column: 5, scope: !426)
!436 = !DILocation(line: 104, column: 45, scope: !426)
!437 = !DILocation(line: 103, column: 35, scope: !421)
!438 = !DILocation(line: 103, column: 3, scope: !421)
!439 = distinct !{!439, !424, !440, !238}
!440 = !DILocation(line: 105, column: 27, scope: !418)
!441 = !DILocation(line: 106, column: 2, scope: !413)
!442 = !DILocation(line: 108, column: 11, scope: !410)
!443 = !DILocation(line: 116, column: 17, scope: !253)
!444 = !DILocation(line: 116, column: 25, scope: !253)
!445 = !DILocation(line: 116, column: 5, scope: !253)
!446 = !DILocalVariable(name: "ret", scope: !253, file: !3, line: 118, type: !79)
!447 = !DILocation(line: 118, column: 9, scope: !253)
!448 = !DILocation(line: 119, column: 24, scope: !253)
!449 = !DILocation(line: 119, column: 5, scope: !253)
!450 = !DILocation(line: 120, column: 50, scope: !253)
!451 = !DILocation(line: 120, column: 55, scope: !253)
!452 = !DILocation(line: 120, column: 2, scope: !253)
!453 = !DILocalVariable(name: "opt", scope: !253, file: !3, line: 125, type: !79)
!454 = !DILocation(line: 125, column: 9, scope: !253)
!455 = !DILocation(line: 126, column: 24, scope: !253)
!456 = !DILocation(line: 126, column: 5, scope: !253)
!457 = !DILocation(line: 128, column: 6, scope: !458)
!458 = distinct !DILexicalBlock(scope: !253, file: !3, line: 128, column: 6)
!459 = !DILocation(line: 128, column: 6, scope: !253)
!460 = !DILocation(line: 140, column: 22, scope: !461)
!461 = distinct !DILexicalBlock(scope: !462, file: !3, line: 140, column: 6)
!462 = distinct !DILexicalBlock(scope: !458, file: !3, line: 128, column: 10)
!463 = !DILocation(line: 140, column: 6, scope: !461)
!464 = !DILocation(line: 140, column: 31, scope: !461)
!465 = !DILocation(line: 140, column: 38, scope: !461)
!466 = !DILocation(line: 140, column: 53, scope: !461)
!467 = !DILocation(line: 140, column: 41, scope: !461)
!468 = !DILocation(line: 140, column: 62, scope: !461)
!469 = !DILocation(line: 140, column: 6, scope: !462)
!470 = !DILocation(line: 142, column: 12, scope: !471)
!471 = distinct !DILexicalBlock(scope: !472, file: !3, line: 142, column: 7)
!472 = distinct !DILexicalBlock(scope: !461, file: !3, line: 141, column: 3)
!473 = !DILocation(line: 142, column: 7, scope: !471)
!474 = !DILocation(line: 142, column: 47, scope: !471)
!475 = !DILocation(line: 142, column: 7, scope: !472)
!476 = !DILocation(line: 144, column: 12, scope: !477)
!477 = distinct !DILexicalBlock(scope: !471, file: !3, line: 143, column: 4)
!478 = !DILocation(line: 144, column: 5, scope: !477)
!479 = !DILocation(line: 145, column: 5, scope: !477)
!480 = !DILocation(line: 147, column: 12, scope: !481)
!481 = distinct !DILexicalBlock(scope: !472, file: !3, line: 147, column: 7)
!482 = !DILocation(line: 147, column: 7, scope: !481)
!483 = !DILocation(line: 147, column: 82, scope: !481)
!484 = !DILocation(line: 147, column: 7, scope: !472)
!485 = !DILocation(line: 149, column: 12, scope: !486)
!486 = distinct !DILexicalBlock(scope: !481, file: !3, line: 148, column: 4)
!487 = !DILocation(line: 149, column: 5, scope: !486)
!488 = !DILocation(line: 150, column: 5, scope: !486)
!489 = !DILocation(line: 154, column: 17, scope: !490)
!490 = distinct !DILexicalBlock(scope: !472, file: !3, line: 154, column: 7)
!491 = !DILocation(line: 154, column: 12, scope: !490)
!492 = !DILocation(line: 154, column: 9, scope: !490)
!493 = !DILocation(line: 154, column: 28, scope: !490)
!494 = !DILocation(line: 154, column: 41, scope: !490)
!495 = !DILocation(line: 154, column: 36, scope: !490)
!496 = !DILocation(line: 154, column: 33, scope: !490)
!497 = !DILocation(line: 154, column: 7, scope: !472)
!498 = !DILocation(line: 155, column: 5, scope: !490)
!499 = !DILocation(line: 157, column: 11, scope: !472)
!500 = !DILocation(line: 157, column: 4, scope: !472)
!501 = !DILocation(line: 158, column: 11, scope: !472)
!502 = !DILocation(line: 158, column: 4, scope: !472)
!503 = !DILocation(line: 159, column: 7, scope: !504)
!504 = distinct !DILexicalBlock(scope: !472, file: !3, line: 159, column: 7)
!505 = !DILocation(line: 159, column: 11, scope: !504)
!506 = !DILocation(line: 159, column: 7, scope: !472)
!507 = !DILocation(line: 159, column: 39, scope: !504)
!508 = !DILocation(line: 159, column: 43, scope: !504)
!509 = !DILocation(line: 159, column: 16, scope: !504)
!510 = !DILocation(line: 161, column: 10, scope: !472)
!511 = !DILocation(line: 161, column: 19, scope: !472)
!512 = !DILocation(line: 161, column: 4, scope: !472)
!513 = !DILocation(line: 163, column: 10, scope: !472)
!514 = !DILocation(line: 163, column: 4, scope: !472)
!515 = !DILocation(line: 164, column: 3, scope: !472)
!516 = !DILocation(line: 166, column: 10, scope: !462)
!517 = !DILocation(line: 166, column: 3, scope: !462)
!518 = !DILocation(line: 167, column: 3, scope: !462)
!519 = !DILocation(line: 173, column: 21, scope: !520)
!520 = distinct !DILexicalBlock(scope: !253, file: !3, line: 173, column: 5)
!521 = !DILocation(line: 173, column: 5, scope: !520)
!522 = !DILocation(line: 173, column: 30, scope: !520)
!523 = !DILocation(line: 173, column: 5, scope: !253)
!524 = !DILocation(line: 182, column: 22, scope: !525)
!525 = distinct !DILexicalBlock(scope: !526, file: !3, line: 182, column: 6)
!526 = distinct !DILexicalBlock(scope: !520, file: !3, line: 174, column: 2)
!527 = !DILocation(line: 182, column: 6, scope: !525)
!528 = !DILocation(line: 182, column: 32, scope: !525)
!529 = !DILocation(line: 182, column: 6, scope: !526)
!530 = !DILocation(line: 185, column: 19, scope: !531)
!531 = distinct !DILexicalBlock(scope: !532, file: !3, line: 185, column: 7)
!532 = distinct !DILexicalBlock(scope: !525, file: !3, line: 183, column: 3)
!533 = !DILocation(line: 185, column: 7, scope: !531)
!534 = !DILocation(line: 185, column: 29, scope: !531)
!535 = !DILocation(line: 185, column: 7, scope: !532)
!536 = !DILocation(line: 185, column: 48, scope: !537)
!537 = distinct !DILexicalBlock(scope: !531, file: !3, line: 185, column: 38)
!538 = !DILocation(line: 185, column: 58, scope: !537)
!539 = !DILocation(line: 185, column: 66, scope: !537)
!540 = !DILocation(line: 185, column: 40, scope: !537)
!541 = !DILocation(line: 185, column: 76, scope: !537)
!542 = !DILocation(line: 190, column: 3, scope: !532)
!543 = !DILocation(line: 192, column: 2, scope: !526)
!544 = !DILocation(line: 173, column: 32, scope: !520)
!545 = !DILabel(scope: !253, name: "sendpage", file: !3, line: 193)
!546 = !DILocation(line: 193, column: 1, scope: !253)
!547 = !DILocation(line: 237, column: 8, scope: !253)
!548 = !DILocation(line: 237, column: 2, scope: !253)
!549 = !DILocation(line: 238, column: 2, scope: !253)
!550 = !DILocation(line: 239, column: 1, scope: !253)
!551 = distinct !DISubprogram(name: "showdir", scope: !3, file: !3, line: 268, type: !552, scopeLine: 269, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!552 = !DISubroutineType(types: !553)
!553 = !{null, !49, !79, !355}
!554 = !DILocalVariable(name: "directory", arg: 1, scope: !551, file: !3, line: 268, type: !49)
!555 = !DILocation(line: 268, column: 20, scope: !551)
!556 = !DILocalVariable(name: "sockfd", arg: 2, scope: !551, file: !3, line: 268, type: !79)
!557 = !DILocation(line: 268, column: 35, scope: !551)
!558 = !DILocalVariable(name: "thehost", arg: 3, scope: !551, file: !3, line: 268, type: !355)
!559 = !DILocation(line: 268, column: 52, scope: !551)
!560 = !DILocalVariable(name: "namelist", scope: !551, file: !3, line: 270, type: !561)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent", file: !564, line: 22, size: 2240, elements: !565)
!564 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/dirent.h", directory: "")
!565 = !{!566, !568, !569, !570, !571}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !563, file: !564, line: 25, baseType: !567, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !98, line: 148, baseType: !53)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !563, file: !564, line: 26, baseType: !285, size: 64, offset: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !563, file: !564, line: 31, baseType: !14, size: 16, offset: 128)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !563, file: !564, line: 32, baseType: !108, size: 8, offset: 144)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !563, file: !564, line: 33, baseType: !572, size: 2048, offset: 152)
!572 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 2048, elements: !573)
!573 = !{!574}
!574 = !DISubrange(count: 256)
!575 = !DILocation(line: 270, column: 18, scope: !551)
!576 = !DILocalVariable(name: "n", scope: !551, file: !3, line: 271, type: !79)
!577 = !DILocation(line: 271, column: 6, scope: !551)
!578 = !DILocalVariable(name: "loop", scope: !551, file: !3, line: 271, type: !79)
!579 = !DILocation(line: 271, column: 9, scope: !551)
!580 = !DILocalVariable(name: "size", scope: !551, file: !3, line: 272, type: !53)
!581 = !DILocation(line: 272, column: 16, scope: !551)
!582 = !DILocalVariable(name: "in", scope: !551, file: !3, line: 273, type: !259)
!583 = !DILocation(line: 273, column: 8, scope: !551)
!584 = !DILocalVariable(name: "tempstring", scope: !551, file: !3, line: 274, type: !37)
!585 = !DILocation(line: 274, column: 7, scope: !551)
!586 = !DILocalVariable(name: "dirheader", scope: !551, file: !3, line: 275, type: !587)
!587 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 16384, elements: !588)
!588 = !{!589}
!589 = !DISubrange(count: 2048)
!590 = !DILocation(line: 275, column: 7, scope: !551)
!591 = !DILocalVariable(name: "dirfooter", scope: !551, file: !3, line: 276, type: !592)
!592 = !DICompositeType(tag: DW_TAG_array_type, baseType: !593, size: 1528, elements: !594)
!593 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !17)
!594 = !{!595}
!595 = !DISubrange(count: 191)
!596 = !DILocation(line: 276, column: 13, scope: !551)
!597 = !DILocation(line: 278, column: 2, scope: !551)
!598 = !DILocation(line: 280, column: 10, scope: !551)
!599 = !DILocation(line: 280, column: 402, scope: !551)
!600 = !DILocation(line: 280, column: 419, scope: !551)
!601 = !DILocation(line: 280, column: 428, scope: !551)
!602 = !DILocation(line: 280, column: 412, scope: !551)
!603 = !DILocation(line: 280, column: 411, scope: !551)
!604 = !DILocation(line: 280, column: 2, scope: !551)
!605 = !DILocation(line: 282, column: 10, scope: !606)
!606 = distinct !DILexicalBlock(scope: !551, file: !3, line: 282, column: 5)
!607 = !DILocation(line: 282, column: 18, scope: !606)
!608 = !DILocation(line: 282, column: 5, scope: !606)
!609 = !DILocation(line: 282, column: 51, scope: !606)
!610 = !DILocation(line: 282, column: 5, scope: !551)
!611 = !DILocation(line: 283, column: 3, scope: !606)
!612 = !DILocation(line: 285, column: 14, scope: !551)
!613 = !DILocation(line: 285, column: 6, scope: !551)
!614 = !DILocation(line: 285, column: 4, scope: !551)
!615 = !DILocation(line: 287, column: 22, scope: !551)
!616 = !DILocation(line: 287, column: 31, scope: !551)
!617 = !DILocation(line: 287, column: 15, scope: !551)
!618 = !DILocation(line: 287, column: 12, scope: !551)
!619 = !DILocation(line: 289, column: 6, scope: !620)
!620 = distinct !DILexicalBlock(scope: !551, file: !3, line: 289, column: 6)
!621 = !DILocation(line: 289, column: 8, scope: !620)
!622 = !DILocation(line: 289, column: 6, scope: !551)
!623 = !DILocation(line: 290, column: 7, scope: !620)
!624 = !DILocation(line: 292, column: 15, scope: !625)
!625 = distinct !DILexicalBlock(scope: !620, file: !3, line: 292, column: 7)
!626 = !DILocation(line: 292, column: 11, scope: !625)
!627 = !DILocation(line: 292, column: 19, scope: !628)
!628 = distinct !DILexicalBlock(scope: !625, file: !3, line: 292, column: 7)
!629 = !DILocation(line: 292, column: 24, scope: !628)
!630 = !DILocation(line: 292, column: 23, scope: !628)
!631 = !DILocation(line: 292, column: 7, scope: !625)
!632 = !DILocation(line: 294, column: 16, scope: !633)
!633 = distinct !DILexicalBlock(scope: !628, file: !3, line: 293, column: 7)
!634 = !DILocation(line: 294, column: 39, scope: !633)
!635 = !DILocation(line: 294, column: 48, scope: !633)
!636 = !DILocation(line: 294, column: 62, scope: !633)
!637 = !DILocation(line: 294, column: 73, scope: !633)
!638 = !DILocation(line: 294, column: 82, scope: !633)
!639 = !DILocation(line: 294, column: 89, scope: !633)
!640 = !DILocation(line: 294, column: 8, scope: !633)
!641 = !DILocation(line: 295, column: 25, scope: !633)
!642 = !DILocation(line: 295, column: 11, scope: !633)
!643 = !DILocation(line: 295, column: 9, scope: !633)
!644 = !DILocation(line: 296, column: 19, scope: !645)
!645 = distinct !DILexicalBlock(scope: !633, file: !3, line: 296, column: 7)
!646 = !DILocation(line: 296, column: 7, scope: !645)
!647 = !DILocation(line: 296, column: 7, scope: !633)
!648 = !DILocation(line: 296, column: 36, scope: !645)
!649 = !DILocation(line: 296, column: 32, scope: !645)
!650 = !DILocation(line: 297, column: 16, scope: !633)
!651 = !DILocation(line: 297, column: 121, scope: !633)
!652 = !DILocation(line: 297, column: 131, scope: !633)
!653 = !DILocation(line: 297, column: 140, scope: !633)
!654 = !DILocation(line: 297, column: 147, scope: !633)
!655 = !DILocation(line: 297, column: 155, scope: !633)
!656 = !DILocation(line: 297, column: 164, scope: !633)
!657 = !DILocation(line: 297, column: 171, scope: !633)
!658 = !DILocation(line: 297, column: 179, scope: !633)
!659 = !DILocation(line: 297, column: 8, scope: !633)
!660 = !DILocation(line: 298, column: 16, scope: !661)
!661 = distinct !DILexicalBlock(scope: !633, file: !3, line: 298, column: 11)
!662 = !DILocation(line: 298, column: 24, scope: !661)
!663 = !DILocation(line: 298, column: 43, scope: !661)
!664 = !DILocation(line: 298, column: 36, scope: !661)
!665 = !DILocation(line: 298, column: 11, scope: !661)
!666 = !DILocation(line: 298, column: 58, scope: !661)
!667 = !DILocation(line: 298, column: 11, scope: !633)
!668 = !DILocation(line: 299, column: 9, scope: !661)
!669 = !DILocation(line: 300, column: 7, scope: !633)
!670 = !DILocation(line: 292, column: 31, scope: !628)
!671 = !DILocation(line: 292, column: 7, scope: !628)
!672 = distinct !{!672, !631, !673, !238}
!673 = !DILocation(line: 300, column: 7, scope: !625)
!674 = !DILocation(line: 302, column: 7, scope: !551)
!675 = !DILocation(line: 302, column: 15, scope: !551)
!676 = !DILocation(line: 302, column: 2, scope: !551)
!677 = !DILocation(line: 303, column: 1, scope: !551)
!678 = distinct !DISubprogram(name: "getmimetype", scope: !3, file: !3, line: 241, type: !679, scopeLine: 242, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!679 = !DISubroutineType(types: !680)
!680 = !{null, !49, !49}
!681 = !DILocalVariable(name: "filename", arg: 1, scope: !678, file: !3, line: 241, type: !49)
!682 = !DILocation(line: 241, column: 24, scope: !678)
!683 = !DILocalVariable(name: "mimetype", arg: 2, scope: !678, file: !3, line: 241, type: !49)
!684 = !DILocation(line: 241, column: 40, scope: !678)
!685 = !DILocalVariable(name: "tempstring", scope: !678, file: !3, line: 243, type: !329)
!686 = !DILocation(line: 243, column: 7, scope: !678)
!687 = !DILocalVariable(name: "tempstring2", scope: !678, file: !3, line: 244, type: !329)
!688 = !DILocation(line: 244, column: 7, scope: !678)
!689 = !DILocalVariable(name: "loop", scope: !678, file: !3, line: 245, type: !56)
!690 = !DILocation(line: 245, column: 15, scope: !678)
!691 = !DILocation(line: 247, column: 2, scope: !678)
!692 = !DILocation(line: 250, column: 10, scope: !693)
!693 = distinct !DILexicalBlock(scope: !678, file: !3, line: 250, column: 2)
!694 = !DILocation(line: 250, column: 6, scope: !693)
!695 = !DILocation(line: 250, column: 14, scope: !696)
!696 = distinct !DILexicalBlock(scope: !693, file: !3, line: 250, column: 2)
!697 = !DILocation(line: 250, column: 26, scope: !696)
!698 = !DILocation(line: 250, column: 19, scope: !696)
!699 = !DILocation(line: 250, column: 18, scope: !696)
!700 = !DILocation(line: 250, column: 36, scope: !696)
!701 = !DILocation(line: 250, column: 39, scope: !696)
!702 = !DILocation(line: 250, column: 55, scope: !696)
!703 = !DILocation(line: 250, column: 48, scope: !696)
!704 = !DILocation(line: 250, column: 65, scope: !696)
!705 = !DILocation(line: 250, column: 64, scope: !696)
!706 = !DILocation(line: 250, column: 70, scope: !696)
!707 = !DILocation(line: 0, scope: !696)
!708 = !DILocation(line: 250, column: 2, scope: !693)
!709 = !DILocation(line: 251, column: 24, scope: !696)
!710 = !DILocation(line: 251, column: 40, scope: !696)
!711 = !DILocation(line: 251, column: 33, scope: !696)
!712 = !DILocation(line: 251, column: 50, scope: !696)
!713 = !DILocation(line: 251, column: 49, scope: !696)
!714 = !DILocation(line: 251, column: 14, scope: !696)
!715 = !DILocation(line: 251, column: 18, scope: !696)
!716 = !DILocation(line: 251, column: 3, scope: !696)
!717 = !DILocation(line: 251, column: 22, scope: !696)
!718 = !DILocation(line: 250, column: 81, scope: !696)
!719 = !DILocation(line: 250, column: 2, scope: !696)
!720 = distinct !{!720, !708, !721, !238}
!721 = !DILocation(line: 251, column: 54, scope: !693)
!722 = !DILocation(line: 254, column: 10, scope: !723)
!723 = distinct !DILexicalBlock(scope: !678, file: !3, line: 254, column: 2)
!724 = !DILocation(line: 254, column: 6, scope: !723)
!725 = !DILocation(line: 254, column: 14, scope: !726)
!726 = distinct !DILexicalBlock(scope: !723, file: !3, line: 254, column: 2)
!727 = !DILocation(line: 254, column: 26, scope: !726)
!728 = !DILocation(line: 254, column: 19, scope: !726)
!729 = !DILocation(line: 254, column: 18, scope: !726)
!730 = !DILocation(line: 254, column: 2, scope: !723)
!731 = !DILocation(line: 255, column: 41, scope: !726)
!732 = !DILocation(line: 255, column: 34, scope: !726)
!733 = !DILocation(line: 255, column: 53, scope: !726)
!734 = !DILocation(line: 255, column: 52, scope: !726)
!735 = !DILocation(line: 255, column: 57, scope: !726)
!736 = !DILocation(line: 255, column: 23, scope: !726)
!737 = !DILocation(line: 255, column: 15, scope: !726)
!738 = !DILocation(line: 255, column: 3, scope: !726)
!739 = !DILocation(line: 255, column: 21, scope: !726)
!740 = !DILocation(line: 254, column: 43, scope: !726)
!741 = !DILocation(line: 254, column: 2, scope: !726)
!742 = distinct !{!742, !730, !743, !238}
!743 = !DILocation(line: 255, column: 59, scope: !723)
!744 = !DILocation(line: 257, column: 14, scope: !678)
!745 = !DILocation(line: 257, column: 2, scope: !678)
!746 = !DILocation(line: 257, column: 20, scope: !678)
!747 = !DILocation(line: 262, column: 10, scope: !748)
!748 = distinct !DILexicalBlock(scope: !678, file: !3, line: 262, column: 2)
!749 = !DILocation(line: 262, column: 6, scope: !748)
!750 = !DILocation(line: 262, column: 32, scope: !751)
!751 = distinct !DILexicalBlock(scope: !748, file: !3, line: 262, column: 2)
!752 = !DILocation(line: 262, column: 21, scope: !751)
!753 = !DILocation(line: 262, column: 14, scope: !751)
!754 = !DILocation(line: 262, column: 46, scope: !751)
!755 = !DILocation(line: 262, column: 67, scope: !751)
!756 = !DILocation(line: 262, column: 56, scope: !751)
!757 = !DILocation(line: 262, column: 77, scope: !751)
!758 = !DILocation(line: 262, column: 49, scope: !751)
!759 = !DILocation(line: 0, scope: !751)
!760 = !DILocation(line: 262, column: 2, scope: !748)
!761 = !DILocation(line: 262, column: 95, scope: !751)
!762 = !DILocation(line: 262, column: 2, scope: !751)
!763 = distinct !{!763, !760, !764, !238}
!764 = !DILocation(line: 262, column: 98, scope: !748)
!765 = !DILocation(line: 264, column: 9, scope: !678)
!766 = !DILocation(line: 264, column: 30, scope: !678)
!767 = !DILocation(line: 264, column: 19, scope: !678)
!768 = !DILocation(line: 264, column: 2, scope: !678)
!769 = !DILocation(line: 265, column: 13, scope: !770)
!770 = distinct !DILexicalBlock(scope: !678, file: !3, line: 265, column: 5)
!771 = !DILocation(line: 265, column: 6, scope: !770)
!772 = !DILocation(line: 265, column: 5, scope: !678)
!773 = !DILocation(line: 265, column: 35, scope: !770)
!774 = !DILocation(line: 265, column: 28, scope: !770)
!775 = !DILocation(line: 266, column: 1, scope: !678)
!776 = distinct !DISubprogram(name: "getfileline", scope: !64, file: !64, line: 42, type: !777, scopeLine: 43, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !63, retainedNodes: !4)
!777 = !DISubroutineType(types: !778)
!778 = !{null, !49, !779}
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !261, line: 7, baseType: !781)
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !263, line: 49, size: 1728, elements: !782)
!782 = !{!783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !781, file: !263, line: 51, baseType: !79, size: 32)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !781, file: !263, line: 54, baseType: !49, size: 64, offset: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !781, file: !263, line: 55, baseType: !49, size: 64, offset: 128)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !781, file: !263, line: 56, baseType: !49, size: 64, offset: 192)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !781, file: !263, line: 57, baseType: !49, size: 64, offset: 256)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !781, file: !263, line: 58, baseType: !49, size: 64, offset: 320)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !781, file: !263, line: 59, baseType: !49, size: 64, offset: 384)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !781, file: !263, line: 60, baseType: !49, size: 64, offset: 448)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !781, file: !263, line: 61, baseType: !49, size: 64, offset: 512)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !781, file: !263, line: 64, baseType: !49, size: 64, offset: 576)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !781, file: !263, line: 65, baseType: !49, size: 64, offset: 640)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !781, file: !263, line: 66, baseType: !49, size: 64, offset: 704)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !781, file: !263, line: 68, baseType: !278, size: 64, offset: 768)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !781, file: !263, line: 70, baseType: !797, size: 64, offset: 832)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !781, file: !263, line: 72, baseType: !79, size: 32, offset: 896)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !781, file: !263, line: 73, baseType: !79, size: 32, offset: 928)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !781, file: !263, line: 74, baseType: !285, size: 64, offset: 960)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !781, file: !263, line: 77, baseType: !14, size: 16, offset: 1024)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !781, file: !263, line: 78, baseType: !288, size: 8, offset: 1040)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !781, file: !263, line: 79, baseType: !290, size: 8, offset: 1048)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !781, file: !263, line: 81, baseType: !294, size: 64, offset: 1088)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !781, file: !263, line: 89, baseType: !297, size: 64, offset: 1152)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !781, file: !263, line: 91, baseType: !299, size: 64, offset: 1216)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !781, file: !263, line: 92, baseType: !302, size: 64, offset: 1280)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !781, file: !263, line: 93, baseType: !797, size: 64, offset: 1344)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !781, file: !263, line: 94, baseType: !6, size: 64, offset: 1408)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !781, file: !263, line: 95, baseType: !188, size: 64, offset: 1472)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !781, file: !263, line: 96, baseType: !79, size: 32, offset: 1536)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !781, file: !263, line: 98, baseType: !309, size: 160, offset: 1568)
!813 = !DILocalVariable(name: "line", arg: 1, scope: !776, file: !64, line: 42, type: !49)
!814 = !DILocation(line: 42, column: 24, scope: !776)
!815 = !DILocalVariable(name: "in", arg: 2, scope: !776, file: !64, line: 42, type: !779)
!816 = !DILocation(line: 42, column: 36, scope: !776)
!817 = !DILocalVariable(name: "loop", scope: !776, file: !64, line: 44, type: !56)
!818 = !DILocation(line: 44, column: 15, scope: !776)
!819 = !DILocation(line: 45, column: 8, scope: !776)
!820 = !DILocation(line: 45, column: 19, scope: !776)
!821 = !DILocation(line: 45, column: 2, scope: !776)
!822 = !DILocation(line: 46, column: 10, scope: !823)
!823 = distinct !DILexicalBlock(scope: !776, file: !64, line: 46, column: 2)
!824 = !DILocation(line: 46, column: 6, scope: !823)
!825 = !DILocation(line: 46, column: 14, scope: !826)
!826 = distinct !DILexicalBlock(scope: !823, file: !64, line: 46, column: 2)
!827 = !DILocation(line: 46, column: 18, scope: !826)
!828 = !DILocation(line: 46, column: 23, scope: !826)
!829 = !DILocation(line: 46, column: 26, scope: !826)
!830 = !DILocation(line: 46, column: 31, scope: !826)
!831 = !DILocation(line: 46, column: 36, scope: !826)
!832 = !DILocation(line: 0, scope: !826)
!833 = !DILocation(line: 46, column: 2, scope: !823)
!834 = !DILocation(line: 46, column: 55, scope: !835)
!835 = distinct !DILexicalBlock(scope: !826, file: !64, line: 46, column: 55)
!836 = !DILocation(line: 46, column: 60, scope: !835)
!837 = !DILocation(line: 46, column: 65, scope: !835)
!838 = !DILocation(line: 46, column: 72, scope: !835)
!839 = !DILocation(line: 46, column: 75, scope: !835)
!840 = !DILocation(line: 46, column: 80, scope: !835)
!841 = !DILocation(line: 46, column: 85, scope: !835)
!842 = !DILocation(line: 46, column: 55, scope: !826)
!843 = !DILocation(line: 46, column: 93, scope: !835)
!844 = !DILocation(line: 46, column: 98, scope: !835)
!845 = !DILocation(line: 46, column: 104, scope: !835)
!846 = !DILocation(line: 46, column: 87, scope: !835)
!847 = !DILocation(line: 46, column: 48, scope: !826)
!848 = !DILocation(line: 46, column: 2, scope: !826)
!849 = distinct !{!849, !833, !850, !238}
!850 = !DILocation(line: 46, column: 106, scope: !823)
!851 = !DILocation(line: 47, column: 1, scope: !776)
!852 = distinct !DISubprogram(name: "does_file_exist", scope: !64, file: !64, line: 49, type: !853, scopeLine: 50, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !63, retainedNodes: !4)
!853 = !DISubroutineType(types: !854)
!854 = !{!79, !49}
!855 = !DILocalVariable(name: "filename", arg: 1, scope: !852, file: !64, line: 49, type: !49)
!856 = !DILocation(line: 49, column: 27, scope: !852)
!857 = !DILocalVariable(name: "st", scope: !852, file: !64, line: 51, type: !858)
!858 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !859, line: 44, size: 1024, elements: !860)
!859 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/struct_stat.h", directory: "")
!860 = !{!861, !863, !864, !866, !868, !869, !870, !871, !872, !873, !875, !876, !878, !885, !886, !887}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !858, file: !859, line: 46, baseType: !862, size: 64)
!862 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !98, line: 145, baseType: !53)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !858, file: !859, line: 47, baseType: !567, size: 64, offset: 64)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !858, file: !859, line: 48, baseType: !865, size: 32, offset: 128)
!865 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !98, line: 150, baseType: !56)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !858, file: !859, line: 49, baseType: !867, size: 32, offset: 160)
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !98, line: 151, baseType: !56)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !858, file: !859, line: 50, baseType: !149, size: 32, offset: 192)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !858, file: !859, line: 51, baseType: !151, size: 32, offset: 224)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !858, file: !859, line: 52, baseType: !862, size: 64, offset: 256)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !858, file: !859, line: 53, baseType: !862, size: 64, offset: 320)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !858, file: !859, line: 54, baseType: !285, size: 64, offset: 384)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !858, file: !859, line: 55, baseType: !874, size: 32, offset: 448)
!874 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !98, line: 175, baseType: !79)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !858, file: !859, line: 56, baseType: !79, size: 32, offset: 480)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !858, file: !859, line: 57, baseType: !877, size: 64, offset: 512)
!877 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !98, line: 180, baseType: !124)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !858, file: !859, line: 65, baseType: !879, size: 128, offset: 576)
!879 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !880, line: 11, size: 128, elements: !881)
!880 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!881 = !{!882, !883}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !879, file: !880, line: 16, baseType: !123, size: 64)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !879, file: !880, line: 21, baseType: !884, size: 64, offset: 64)
!884 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !98, line: 197, baseType: !124)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !858, file: !859, line: 66, baseType: !879, size: 128, offset: 704)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !858, file: !859, line: 67, baseType: !879, size: 128, offset: 832)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !858, file: !859, line: 79, baseType: !888, size: 64, offset: 960)
!888 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 64, elements: !889)
!889 = !{!24}
!890 = !DILocation(line: 51, column: 14, scope: !852)
!891 = !DILocation(line: 52, column: 10, scope: !892)
!892 = distinct !DILexicalBlock(scope: !852, file: !64, line: 52, column: 5)
!893 = !DILocation(line: 52, column: 5, scope: !892)
!894 = !DILocation(line: 52, column: 25, scope: !892)
!895 = !DILocation(line: 52, column: 40, scope: !892)
!896 = !DILocation(line: 52, column: 28, scope: !892)
!897 = !DILocation(line: 52, column: 5, scope: !852)
!898 = !DILocation(line: 52, column: 51, scope: !892)
!899 = !DILocation(line: 53, column: 2, scope: !852)
!900 = !DILocation(line: 54, column: 1, scope: !852)
!901 = distinct !DISubprogram(name: "isDirectory", scope: !64, file: !64, line: 63, type: !853, scopeLine: 64, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !63, retainedNodes: !4)
!902 = !DILocalVariable(name: "filename", arg: 1, scope: !901, file: !64, line: 63, type: !49)
!903 = !DILocation(line: 63, column: 23, scope: !901)
!904 = !DILocalVariable(name: "st", scope: !901, file: !64, line: 65, type: !858)
!905 = !DILocation(line: 65, column: 14, scope: !901)
!906 = !DILocation(line: 67, column: 10, scope: !907)
!907 = distinct !DILexicalBlock(scope: !901, file: !64, line: 67, column: 5)
!908 = !DILocation(line: 67, column: 5, scope: !907)
!909 = !DILocation(line: 67, column: 5, scope: !901)
!910 = !DILocation(line: 67, column: 26, scope: !907)
!911 = !DILocation(line: 68, column: 6, scope: !912)
!912 = distinct !DILexicalBlock(scope: !901, file: !64, line: 68, column: 5)
!913 = !DILocation(line: 68, column: 5, scope: !901)
!914 = !DILocation(line: 68, column: 27, scope: !912)
!915 = !DILocation(line: 70, column: 2, scope: !901)
!916 = !DILocation(line: 71, column: 1, scope: !901)
!917 = distinct !DISubprogram(name: "get_file_size", scope: !64, file: !64, line: 56, type: !918, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !63, retainedNodes: !4)
!918 = !DISubroutineType(types: !919)
!919 = !{!53, !49}
!920 = !DILocalVariable(name: "filename", arg: 1, scope: !917, file: !64, line: 56, type: !49)
!921 = !DILocation(line: 56, column: 35, scope: !917)
!922 = !DILocalVariable(name: "st", scope: !917, file: !64, line: 58, type: !858)
!923 = !DILocation(line: 58, column: 14, scope: !917)
!924 = !DILocation(line: 59, column: 11, scope: !925)
!925 = distinct !DILexicalBlock(scope: !917, file: !64, line: 59, column: 5)
!926 = !DILocation(line: 59, column: 6, scope: !925)
!927 = !DILocation(line: 59, column: 5, scope: !917)
!928 = !DILocation(line: 59, column: 37, scope: !925)
!929 = !DILocation(line: 59, column: 27, scope: !925)
!930 = !DILocation(line: 60, column: 2, scope: !917)
!931 = !DILocation(line: 61, column: 1, scope: !917)
!932 = distinct !DISubprogram(name: "count_vhosts", scope: !64, file: !64, line: 73, type: !933, scopeLine: 74, spFlags: DISPFlagDefinition, unit: !63, retainedNodes: !4)
!933 = !DISubroutineType(types: !934)
!934 = !{!53}
!935 = !DILocalVariable(name: "in", scope: !932, file: !64, line: 75, type: !779)
!936 = !DILocation(line: 75, column: 8, scope: !932)
!937 = !DILocalVariable(name: "count", scope: !932, file: !64, line: 76, type: !53)
!938 = !DILocation(line: 76, column: 16, scope: !932)
!939 = !DILocalVariable(name: "tempstring", scope: !932, file: !64, line: 77, type: !37)
!940 = !DILocation(line: 77, column: 7, scope: !932)
!941 = !DILocalVariable(name: "ptr1", scope: !932, file: !64, line: 77, type: !49)
!942 = !DILocation(line: 77, column: 25, scope: !932)
!943 = !DILocation(line: 79, column: 11, scope: !944)
!944 = distinct !DILexicalBlock(scope: !932, file: !64, line: 79, column: 5)
!945 = !DILocation(line: 79, column: 9, scope: !944)
!946 = !DILocation(line: 79, column: 44, scope: !944)
!947 = !DILocation(line: 79, column: 5, scope: !932)
!948 = !DILocation(line: 80, column: 3, scope: !944)
!949 = !DILocation(line: 82, column: 2, scope: !932)
!950 = !DILocation(line: 82, column: 14, scope: !932)
!951 = !DILocation(line: 82, column: 9, scope: !932)
!952 = !DILocation(line: 82, column: 8, scope: !932)
!953 = !DILocation(line: 84, column: 3, scope: !954)
!954 = distinct !DILexicalBlock(scope: !932, file: !64, line: 83, column: 2)
!955 = !DILocation(line: 85, column: 15, scope: !954)
!956 = !DILocation(line: 85, column: 27, scope: !954)
!957 = !DILocation(line: 85, column: 3, scope: !954)
!958 = !DILocation(line: 86, column: 11, scope: !959)
!959 = distinct !DILexicalBlock(scope: !954, file: !64, line: 86, column: 6)
!960 = !DILocation(line: 86, column: 6, scope: !959)
!961 = !DILocation(line: 86, column: 6, scope: !954)
!962 = !DILocation(line: 86, column: 16, scope: !959)
!963 = !DILocation(line: 88, column: 17, scope: !954)
!964 = !DILocation(line: 88, column: 10, scope: !954)
!965 = !DILocation(line: 88, column: 8, scope: !954)
!966 = !DILocation(line: 89, column: 6, scope: !967)
!967 = distinct !DILexicalBlock(scope: !954, file: !64, line: 89, column: 6)
!968 = !DILocation(line: 89, column: 11, scope: !967)
!969 = !DILocation(line: 89, column: 24, scope: !967)
!970 = !DILocation(line: 89, column: 15, scope: !967)
!971 = !DILocation(line: 89, column: 6, scope: !954)
!972 = !DILocation(line: 90, column: 9, scope: !967)
!973 = !DILocation(line: 90, column: 4, scope: !967)
!974 = distinct !{!974, !949, !975, !238}
!975 = !DILocation(line: 91, column: 2, scope: !932)
!976 = !DILocation(line: 93, column: 9, scope: !932)
!977 = !DILocation(line: 93, column: 2, scope: !932)
!978 = !DILocation(line: 94, column: 9, scope: !932)
!979 = !DILocation(line: 94, column: 2, scope: !932)
!980 = !DILocation(line: 95, column: 1, scope: !932)
!981 = distinct !DISubprogram(name: "gstricmp", scope: !64, file: !64, line: 196, type: !982, scopeLine: 197, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !63, retainedNodes: !4)
!982 = !DISubroutineType(types: !983)
!983 = !{!79, !49, !49}
!984 = !DILocalVariable(name: "string1", arg: 1, scope: !981, file: !64, line: 196, type: !49)
!985 = !DILocation(line: 196, column: 20, scope: !981)
!986 = !DILocalVariable(name: "string2", arg: 2, scope: !981, file: !64, line: 196, type: !49)
!987 = !DILocation(line: 196, column: 35, scope: !981)
!988 = !DILocalVariable(name: "loop", scope: !981, file: !64, line: 198, type: !79)
!989 = !DILocation(line: 198, column: 6, scope: !981)
!990 = !DILocation(line: 200, column: 6, scope: !991)
!991 = distinct !DILexicalBlock(scope: !981, file: !64, line: 200, column: 5)
!992 = !DILocation(line: 200, column: 14, scope: !991)
!993 = !DILocation(line: 200, column: 18, scope: !991)
!994 = !DILocation(line: 200, column: 5, scope: !981)
!995 = !DILocation(line: 200, column: 27, scope: !991)
!996 = !DILocation(line: 202, column: 2, scope: !981)
!997 = !DILocation(line: 202, column: 9, scope: !981)
!998 = !DILocation(line: 202, column: 8, scope: !981)
!999 = !DILocation(line: 202, column: 17, scope: !981)
!1000 = !DILocation(line: 202, column: 21, scope: !981)
!1001 = !DILocation(line: 202, column: 20, scope: !981)
!1002 = !DILocation(line: 0, scope: !981)
!1003 = !DILocation(line: 203, column: 22, scope: !1004)
!1004 = distinct !DILexicalBlock(scope: !981, file: !64, line: 203, column: 5)
!1005 = !DILocation(line: 203, column: 13, scope: !1004)
!1006 = !DILocation(line: 203, column: 5, scope: !1004)
!1007 = !DILocation(line: 203, column: 47, scope: !1004)
!1008 = !DILocation(line: 203, column: 38, scope: !1004)
!1009 = !DILocation(line: 203, column: 30, scope: !1004)
!1010 = !DILocation(line: 203, column: 27, scope: !1004)
!1011 = !DILocation(line: 203, column: 5, scope: !981)
!1012 = !DILocation(line: 203, column: 53, scope: !1004)
!1013 = distinct !{!1013, !996, !1014, !238}
!1014 = !DILocation(line: 203, column: 60, scope: !981)
!1015 = !DILocation(line: 205, column: 22, scope: !1016)
!1016 = distinct !DILexicalBlock(scope: !981, file: !64, line: 205, column: 5)
!1017 = !DILocation(line: 205, column: 13, scope: !1016)
!1018 = !DILocation(line: 205, column: 5, scope: !1016)
!1019 = !DILocation(line: 205, column: 47, scope: !1016)
!1020 = !DILocation(line: 205, column: 38, scope: !1016)
!1021 = !DILocation(line: 205, column: 30, scope: !1016)
!1022 = !DILocation(line: 205, column: 27, scope: !1016)
!1023 = !DILocation(line: 205, column: 5, scope: !981)
!1024 = !DILocation(line: 205, column: 53, scope: !1016)
!1025 = !DILocation(line: 207, column: 2, scope: !981)
!1026 = !DILocation(line: 208, column: 1, scope: !981)
!1027 = distinct !DISubprogram(name: "VirtualHostDefinition", scope: !64, file: !64, line: 97, type: !1028, scopeLine: 98, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !63, retainedNodes: !4)
!1028 = !DISubroutineType(types: !1029)
!1029 = !{null, !779}
!1030 = !DILocalVariable(name: "in", arg: 1, scope: !1027, file: !64, line: 97, type: !779)
!1031 = !DILocation(line: 97, column: 34, scope: !1027)
!1032 = !DILocalVariable(name: "tempstring", scope: !1027, file: !64, line: 99, type: !37)
!1033 = !DILocation(line: 99, column: 7, scope: !1027)
!1034 = !DILocalVariable(name: "ptr1", scope: !1027, file: !64, line: 99, type: !49)
!1035 = !DILocation(line: 99, column: 25, scope: !1027)
!1036 = !DILocalVariable(name: "ptr2", scope: !1027, file: !64, line: 99, type: !49)
!1037 = !DILocation(line: 99, column: 34, scope: !1027)
!1038 = !DILocalVariable(name: "thevhost", scope: !1027, file: !64, line: 100, type: !1039)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64)
!1040 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_vhost", file: !33, line: 30, baseType: !1041)
!1041 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !33, line: 23, size: 10200, elements: !1042)
!1042 = !{!1043, !1044, !1045, !1046, !1047}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !1041, file: !33, line: 25, baseType: !37, size: 2040)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "DOCUMENTROOT", scope: !1041, file: !33, line: 26, baseType: !37, size: 2040, offset: 2040)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "DEFAULTPAGE", scope: !1041, file: !33, line: 27, baseType: !37, size: 2040, offset: 4080)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "CGIBINDIR", scope: !1041, file: !33, line: 28, baseType: !37, size: 2040, offset: 6120)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "CGIBINROOT", scope: !1041, file: !33, line: 29, baseType: !37, size: 2040, offset: 8160)
!1048 = !DILocation(line: 100, column: 11, scope: !1027)
!1049 = !DILocation(line: 102, column: 14, scope: !1027)
!1050 = !DILocation(line: 102, column: 21, scope: !1027)
!1051 = !DILocation(line: 102, column: 11, scope: !1027)
!1052 = !DILocation(line: 104, column: 9, scope: !1027)
!1053 = !DILocation(line: 104, column: 19, scope: !1027)
!1054 = !DILocation(line: 104, column: 2, scope: !1027)
!1055 = !DILocation(line: 105, column: 9, scope: !1027)
!1056 = !DILocation(line: 105, column: 19, scope: !1027)
!1057 = !DILocation(line: 105, column: 2, scope: !1027)
!1058 = !DILocation(line: 106, column: 9, scope: !1027)
!1059 = !DILocation(line: 106, column: 19, scope: !1027)
!1060 = !DILocation(line: 106, column: 2, scope: !1027)
!1061 = !DILocation(line: 107, column: 9, scope: !1027)
!1062 = !DILocation(line: 107, column: 19, scope: !1027)
!1063 = !DILocation(line: 107, column: 2, scope: !1027)
!1064 = !DILocation(line: 108, column: 9, scope: !1027)
!1065 = !DILocation(line: 108, column: 19, scope: !1027)
!1066 = !DILocation(line: 108, column: 2, scope: !1027)
!1067 = !DILocation(line: 110, column: 2, scope: !1027)
!1068 = !DILocation(line: 110, column: 14, scope: !1027)
!1069 = !DILocation(line: 110, column: 9, scope: !1027)
!1070 = !DILocation(line: 110, column: 8, scope: !1027)
!1071 = !DILocation(line: 112, column: 15, scope: !1072)
!1072 = distinct !DILexicalBlock(scope: !1027, file: !64, line: 111, column: 2)
!1073 = !DILocation(line: 112, column: 27, scope: !1072)
!1074 = !DILocation(line: 112, column: 3, scope: !1072)
!1075 = !DILocation(line: 114, column: 11, scope: !1076)
!1076 = distinct !DILexicalBlock(scope: !1072, file: !64, line: 114, column: 6)
!1077 = !DILocation(line: 114, column: 6, scope: !1076)
!1078 = !DILocation(line: 114, column: 6, scope: !1072)
!1079 = !DILocation(line: 114, column: 16, scope: !1076)
!1080 = !DILocation(line: 115, column: 17, scope: !1072)
!1081 = !DILocation(line: 115, column: 10, scope: !1072)
!1082 = !DILocation(line: 115, column: 8, scope: !1072)
!1083 = !DILocation(line: 116, column: 10, scope: !1072)
!1084 = !DILocation(line: 116, column: 8, scope: !1072)
!1085 = !DILocation(line: 118, column: 7, scope: !1086)
!1086 = distinct !DILexicalBlock(scope: !1072, file: !64, line: 118, column: 6)
!1087 = !DILocation(line: 118, column: 6, scope: !1072)
!1088 = !DILocation(line: 118, column: 13, scope: !1086)
!1089 = distinct !{!1089, !1067, !1090, !238}
!1090 = !DILocation(line: 134, column: 2, scope: !1027)
!1091 = !DILocation(line: 119, column: 6, scope: !1092)
!1092 = distinct !DILexicalBlock(scope: !1072, file: !64, line: 119, column: 6)
!1093 = !DILocation(line: 119, column: 13, scope: !1092)
!1094 = !DILocation(line: 119, column: 19, scope: !1092)
!1095 = !DILocation(line: 119, column: 23, scope: !1092)
!1096 = !DILocation(line: 119, column: 6, scope: !1072)
!1097 = !DILocation(line: 119, column: 29, scope: !1092)
!1098 = !DILocation(line: 120, column: 6, scope: !1099)
!1099 = distinct !DILexicalBlock(scope: !1072, file: !64, line: 120, column: 6)
!1100 = !DILocation(line: 120, column: 14, scope: !1099)
!1101 = !DILocation(line: 120, column: 6, scope: !1072)
!1102 = !DILocation(line: 120, column: 22, scope: !1099)
!1103 = !DILocation(line: 122, column: 16, scope: !1104)
!1104 = distinct !DILexicalBlock(scope: !1072, file: !64, line: 122, column: 6)
!1105 = !DILocation(line: 122, column: 7, scope: !1104)
!1106 = !DILocation(line: 122, column: 6, scope: !1072)
!1107 = !DILocation(line: 123, column: 4, scope: !1104)
!1108 = !DILocation(line: 124, column: 21, scope: !1109)
!1109 = distinct !DILexicalBlock(scope: !1104, file: !64, line: 124, column: 11)
!1110 = !DILocation(line: 124, column: 12, scope: !1109)
!1111 = !DILocation(line: 124, column: 11, scope: !1104)
!1112 = !DILocation(line: 125, column: 11, scope: !1109)
!1113 = !DILocation(line: 125, column: 21, scope: !1109)
!1114 = !DILocation(line: 125, column: 27, scope: !1109)
!1115 = !DILocation(line: 125, column: 4, scope: !1109)
!1116 = !DILocation(line: 126, column: 21, scope: !1117)
!1117 = distinct !DILexicalBlock(scope: !1109, file: !64, line: 126, column: 11)
!1118 = !DILocation(line: 126, column: 12, scope: !1117)
!1119 = !DILocation(line: 126, column: 11, scope: !1109)
!1120 = !DILocation(line: 127, column: 18, scope: !1117)
!1121 = !DILocation(line: 127, column: 28, scope: !1117)
!1122 = !DILocation(line: 127, column: 42, scope: !1117)
!1123 = !DILocation(line: 127, column: 11, scope: !1117)
!1124 = !DILocation(line: 128, column: 21, scope: !1125)
!1125 = distinct !DILexicalBlock(scope: !1117, file: !64, line: 128, column: 11)
!1126 = !DILocation(line: 128, column: 12, scope: !1125)
!1127 = !DILocation(line: 128, column: 11, scope: !1117)
!1128 = !DILocation(line: 129, column: 18, scope: !1125)
!1129 = !DILocation(line: 129, column: 28, scope: !1125)
!1130 = !DILocation(line: 129, column: 41, scope: !1125)
!1131 = !DILocation(line: 129, column: 11, scope: !1125)
!1132 = !DILocation(line: 130, column: 21, scope: !1133)
!1133 = distinct !DILexicalBlock(scope: !1125, file: !64, line: 130, column: 11)
!1134 = !DILocation(line: 130, column: 12, scope: !1133)
!1135 = !DILocation(line: 130, column: 11, scope: !1125)
!1136 = !DILocation(line: 131, column: 18, scope: !1133)
!1137 = !DILocation(line: 131, column: 28, scope: !1133)
!1138 = !DILocation(line: 131, column: 39, scope: !1133)
!1139 = !DILocation(line: 131, column: 11, scope: !1133)
!1140 = !DILocation(line: 132, column: 21, scope: !1141)
!1141 = distinct !DILexicalBlock(scope: !1133, file: !64, line: 132, column: 11)
!1142 = !DILocation(line: 132, column: 12, scope: !1141)
!1143 = !DILocation(line: 132, column: 11, scope: !1133)
!1144 = !DILocation(line: 133, column: 18, scope: !1141)
!1145 = !DILocation(line: 133, column: 28, scope: !1141)
!1146 = !DILocation(line: 133, column: 40, scope: !1141)
!1147 = !DILocation(line: 133, column: 11, scope: !1141)
!1148 = !DILocation(line: 136, column: 11, scope: !1027)
!1149 = !DILocation(line: 137, column: 1, scope: !1027)
!1150 = distinct !DISubprogram(name: "gstrlwr", scope: !64, file: !64, line: 139, type: !1151, scopeLine: 140, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !63, retainedNodes: !4)
!1151 = !DISubroutineType(types: !1152)
!1152 = !{null, !49}
!1153 = !DILocalVariable(name: "string", arg: 1, scope: !1150, file: !64, line: 139, type: !49)
!1154 = !DILocation(line: 139, column: 20, scope: !1150)
!1155 = !DILocalVariable(name: "loop", scope: !1150, file: !64, line: 141, type: !56)
!1156 = !DILocation(line: 141, column: 15, scope: !1150)
!1157 = !DILocation(line: 143, column: 6, scope: !1158)
!1158 = distinct !DILexicalBlock(scope: !1150, file: !64, line: 143, column: 5)
!1159 = !DILocation(line: 143, column: 5, scope: !1150)
!1160 = !DILocation(line: 143, column: 14, scope: !1158)
!1161 = !DILocation(line: 144, column: 10, scope: !1162)
!1162 = distinct !DILexicalBlock(scope: !1150, file: !64, line: 144, column: 2)
!1163 = !DILocation(line: 144, column: 6, scope: !1162)
!1164 = !DILocation(line: 144, column: 14, scope: !1165)
!1165 = distinct !DILexicalBlock(scope: !1162, file: !64, line: 144, column: 2)
!1166 = !DILocation(line: 144, column: 18, scope: !1165)
!1167 = !DILocation(line: 144, column: 23, scope: !1165)
!1168 = !DILocation(line: 144, column: 26, scope: !1165)
!1169 = !DILocation(line: 144, column: 33, scope: !1165)
!1170 = !DILocation(line: 0, scope: !1165)
!1171 = !DILocation(line: 144, column: 2, scope: !1162)
!1172 = !DILocation(line: 145, column: 26, scope: !1165)
!1173 = !DILocation(line: 145, column: 33, scope: !1165)
!1174 = !DILocation(line: 145, column: 18, scope: !1165)
!1175 = !DILocation(line: 145, column: 3, scope: !1165)
!1176 = !DILocation(line: 145, column: 10, scope: !1165)
!1177 = !DILocation(line: 145, column: 16, scope: !1165)
!1178 = !DILocation(line: 144, column: 44, scope: !1165)
!1179 = !DILocation(line: 144, column: 2, scope: !1165)
!1180 = distinct !{!1180, !1171, !1181, !238}
!1181 = !DILocation(line: 145, column: 38, scope: !1162)
!1182 = !DILocation(line: 146, column: 1, scope: !1150)
!1183 = distinct !DISubprogram(name: "readinconfig", scope: !64, file: !64, line: 148, type: !1184, scopeLine: 149, spFlags: DISPFlagDefinition, unit: !63, retainedNodes: !4)
!1184 = !DISubroutineType(types: !1185)
!1185 = !{null}
!1186 = !DILocalVariable(name: "in", scope: !1183, file: !64, line: 150, type: !779)
!1187 = !DILocation(line: 150, column: 8, scope: !1183)
!1188 = !DILocalVariable(name: "ptr1", scope: !1183, file: !64, line: 151, type: !49)
!1189 = !DILocation(line: 151, column: 8, scope: !1183)
!1190 = !DILocalVariable(name: "ptr2", scope: !1183, file: !64, line: 151, type: !49)
!1191 = !DILocation(line: 151, column: 17, scope: !1183)
!1192 = !DILocalVariable(name: "tempstring", scope: !1183, file: !64, line: 152, type: !37)
!1193 = !DILocation(line: 152, column: 7, scope: !1183)
!1194 = !DILocalVariable(name: "loop", scope: !1183, file: !64, line: 153, type: !79)
!1195 = !DILocation(line: 153, column: 6, scope: !1183)
!1196 = !DILocation(line: 156, column: 11, scope: !1197)
!1197 = distinct !DILexicalBlock(scope: !1183, file: !64, line: 156, column: 5)
!1198 = !DILocation(line: 156, column: 9, scope: !1197)
!1199 = !DILocation(line: 156, column: 43, scope: !1197)
!1200 = !DILocation(line: 156, column: 5, scope: !1183)
!1201 = !DILocation(line: 157, column: 3, scope: !1197)
!1202 = !DILocation(line: 159, column: 11, scope: !1183)
!1203 = !DILocation(line: 161, column: 2, scope: !1183)
!1204 = !DILocation(line: 161, column: 14, scope: !1183)
!1205 = !DILocation(line: 161, column: 9, scope: !1183)
!1206 = !DILocation(line: 161, column: 8, scope: !1183)
!1207 = !DILocation(line: 163, column: 15, scope: !1208)
!1208 = distinct !DILexicalBlock(scope: !1183, file: !64, line: 162, column: 2)
!1209 = !DILocation(line: 163, column: 27, scope: !1208)
!1210 = !DILocation(line: 163, column: 3, scope: !1208)
!1211 = !DILocation(line: 165, column: 11, scope: !1212)
!1212 = distinct !DILexicalBlock(scope: !1208, file: !64, line: 165, column: 6)
!1213 = !DILocation(line: 165, column: 6, scope: !1212)
!1214 = !DILocation(line: 165, column: 6, scope: !1208)
!1215 = !DILocation(line: 165, column: 16, scope: !1212)
!1216 = !DILocation(line: 166, column: 17, scope: !1208)
!1217 = !DILocation(line: 166, column: 10, scope: !1208)
!1218 = !DILocation(line: 166, column: 8, scope: !1208)
!1219 = !DILocation(line: 167, column: 10, scope: !1208)
!1220 = !DILocation(line: 167, column: 8, scope: !1208)
!1221 = !DILocation(line: 169, column: 7, scope: !1222)
!1222 = distinct !DILexicalBlock(scope: !1208, file: !64, line: 169, column: 6)
!1223 = !DILocation(line: 169, column: 6, scope: !1208)
!1224 = !DILocation(line: 169, column: 13, scope: !1222)
!1225 = distinct !{!1225, !1203, !1226, !238}
!1226 = !DILocation(line: 191, column: 2, scope: !1183)
!1227 = !DILocation(line: 170, column: 6, scope: !1228)
!1228 = distinct !DILexicalBlock(scope: !1208, file: !64, line: 170, column: 6)
!1229 = !DILocation(line: 170, column: 13, scope: !1228)
!1230 = !DILocation(line: 170, column: 19, scope: !1228)
!1231 = !DILocation(line: 170, column: 23, scope: !1228)
!1232 = !DILocation(line: 170, column: 6, scope: !1208)
!1233 = !DILocation(line: 170, column: 29, scope: !1228)
!1234 = !DILocation(line: 171, column: 6, scope: !1235)
!1235 = distinct !DILexicalBlock(scope: !1208, file: !64, line: 171, column: 6)
!1236 = !DILocation(line: 171, column: 14, scope: !1235)
!1237 = !DILocation(line: 171, column: 6, scope: !1208)
!1238 = !DILocation(line: 171, column: 22, scope: !1235)
!1239 = !DILocation(line: 173, column: 16, scope: !1240)
!1240 = distinct !DILexicalBlock(scope: !1208, file: !64, line: 173, column: 6)
!1241 = !DILocation(line: 173, column: 7, scope: !1240)
!1242 = !DILocation(line: 173, column: 6, scope: !1208)
!1243 = !DILocation(line: 174, column: 23, scope: !1240)
!1244 = !DILocation(line: 174, column: 4, scope: !1240)
!1245 = !DILocation(line: 175, column: 21, scope: !1246)
!1246 = distinct !DILexicalBlock(scope: !1240, file: !64, line: 175, column: 11)
!1247 = !DILocation(line: 175, column: 12, scope: !1246)
!1248 = !DILocation(line: 175, column: 11, scope: !1240)
!1249 = !DILocation(line: 176, column: 37, scope: !1246)
!1250 = !DILocation(line: 176, column: 4, scope: !1246)
!1251 = !DILocation(line: 177, column: 21, scope: !1252)
!1252 = distinct !DILexicalBlock(scope: !1246, file: !64, line: 177, column: 11)
!1253 = !DILocation(line: 177, column: 12, scope: !1252)
!1254 = !DILocation(line: 177, column: 11, scope: !1246)
!1255 = !DILocation(line: 178, column: 36, scope: !1252)
!1256 = !DILocation(line: 178, column: 4, scope: !1252)
!1257 = !DILocation(line: 179, column: 21, scope: !1258)
!1258 = distinct !DILexicalBlock(scope: !1252, file: !64, line: 179, column: 11)
!1259 = !DILocation(line: 179, column: 12, scope: !1258)
!1260 = !DILocation(line: 179, column: 11, scope: !1252)
!1261 = !DILocation(line: 180, column: 34, scope: !1258)
!1262 = !DILocation(line: 180, column: 4, scope: !1258)
!1263 = !DILocation(line: 181, column: 21, scope: !1264)
!1264 = distinct !DILexicalBlock(scope: !1258, file: !64, line: 181, column: 11)
!1265 = !DILocation(line: 181, column: 12, scope: !1264)
!1266 = !DILocation(line: 181, column: 11, scope: !1258)
!1267 = !DILocation(line: 182, column: 35, scope: !1264)
!1268 = !DILocation(line: 182, column: 4, scope: !1264)
!1269 = !DILocation(line: 183, column: 21, scope: !1270)
!1270 = distinct !DILexicalBlock(scope: !1264, file: !64, line: 183, column: 11)
!1271 = !DILocation(line: 183, column: 12, scope: !1270)
!1272 = !DILocation(line: 183, column: 11, scope: !1264)
!1273 = !DILocation(line: 184, column: 22, scope: !1270)
!1274 = !DILocation(line: 184, column: 17, scope: !1270)
!1275 = !DILocation(line: 184, column: 15, scope: !1270)
!1276 = !DILocation(line: 184, column: 4, scope: !1270)
!1277 = !DILocation(line: 185, column: 21, scope: !1278)
!1278 = distinct !DILexicalBlock(scope: !1270, file: !64, line: 185, column: 11)
!1279 = !DILocation(line: 185, column: 12, scope: !1278)
!1280 = !DILocation(line: 185, column: 11, scope: !1270)
!1281 = !DILocation(line: 186, column: 23, scope: !1278)
!1282 = !DILocation(line: 186, column: 4, scope: !1278)
!1283 = !DILocation(line: 187, column: 21, scope: !1284)
!1284 = distinct !DILexicalBlock(scope: !1278, file: !64, line: 187, column: 11)
!1285 = !DILocation(line: 187, column: 12, scope: !1284)
!1286 = !DILocation(line: 187, column: 11, scope: !1278)
!1287 = !DILocation(line: 188, column: 26, scope: !1284)
!1288 = !DILocation(line: 188, column: 4, scope: !1284)
!1289 = !DILocation(line: 190, column: 64, scope: !1284)
!1290 = !DILocation(line: 190, column: 4, scope: !1284)
!1291 = !DILocation(line: 193, column: 9, scope: !1183)
!1292 = !DILocation(line: 193, column: 2, scope: !1183)
!1293 = !DILocation(line: 194, column: 1, scope: !1183)
!1294 = distinct !DISubprogram(name: "Log", scope: !64, file: !64, line: 210, type: !1295, scopeLine: 211, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !63, retainedNodes: !4)
!1295 = !DISubroutineType(types: !1296)
!1296 = !{null, !49, null}
!1297 = !DILocalVariable(name: "format", arg: 1, scope: !1294, file: !64, line: 210, type: !49)
!1298 = !DILocation(line: 210, column: 16, scope: !1294)
!1299 = !DILocalVariable(name: "logfile", scope: !1294, file: !64, line: 212, type: !779)
!1300 = !DILocation(line: 212, column: 8, scope: !1294)
!1301 = !DILocalVariable(name: "t", scope: !1294, file: !64, line: 213, type: !1302)
!1302 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !1303, line: 10, baseType: !123)
!1303 = !DIFile(filename: "/usr/include/aarch64-linux-gnu/bits/types/time_t.h", directory: "")
!1304 = !DILocation(line: 213, column: 9, scope: !1294)
!1305 = !DILocalVariable(name: "tm", scope: !1294, file: !64, line: 214, type: !1306)
!1306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1307, size: 64)
!1307 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm", scope: !1294, file: !64, line: 214, flags: DIFlagFwdDecl)
!1308 = !DILocation(line: 214, column: 13, scope: !1294)
!1309 = !DILocalVariable(name: "temp", scope: !1294, file: !64, line: 215, type: !1310)
!1310 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 1600, elements: !1311)
!1311 = !{!1312}
!1312 = !DISubrange(count: 200)
!1313 = !DILocation(line: 215, column: 7, scope: !1294)
!1314 = !DILocalVariable(name: "temp2", scope: !1294, file: !64, line: 215, type: !1310)
!1315 = !DILocation(line: 215, column: 18, scope: !1294)
!1316 = !DILocalVariable(name: "logfilename", scope: !1294, file: !64, line: 215, type: !37)
!1317 = !DILocation(line: 215, column: 30, scope: !1294)
!1318 = !DILocalVariable(name: "datetime", scope: !1294, file: !64, line: 216, type: !1319)
!1319 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 176, elements: !1320)
!1320 = !{!1321}
!1321 = !DISubrange(count: 22)
!1322 = !DILocation(line: 216, column: 7, scope: !1294)
!1323 = !DILocalVariable(name: "datetime_final", scope: !1294, file: !64, line: 217, type: !1324)
!1324 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 1024, elements: !1325)
!1325 = !{!1326}
!1326 = !DISubrange(count: 128)
!1327 = !DILocation(line: 217, column: 7, scope: !1294)
!1328 = !DILocalVariable(name: "ap", scope: !1294, file: !64, line: 218, type: !1329)
!1329 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !1330, line: 52, baseType: !1331)
!1330 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!1331 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !1332, line: 32, baseType: !1333)
!1332 = !DIFile(filename: "/usr/lib/llvm-13/lib/clang/13.0.1/include/stdarg.h", directory: "")
!1333 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !64, baseType: !1334)
!1334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list", scope: !1335, size: 256, elements: !1336)
!1335 = !DINamespace(name: "std", scope: null)
!1336 = !{!1337, !1338, !1339, !1340, !1341}
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "__stack", scope: !1334, file: !64, line: 218, baseType: !6, size: 64)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_top", scope: !1334, file: !64, line: 218, baseType: !6, size: 64, offset: 64)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_top", scope: !1334, file: !64, line: 218, baseType: !6, size: 64, offset: 128)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "__gr_offs", scope: !1334, file: !64, line: 218, baseType: !79, size: 32, offset: 192)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "__vr_offs", scope: !1334, file: !64, line: 218, baseType: !79, size: 32, offset: 224)
!1342 = !DILocation(line: 218, column: 10, scope: !1294)
!1343 = !DILocation(line: 220, column: 24, scope: !1294)
!1344 = !DILocation(line: 220, column: 5, scope: !1294)
!1345 = !DILocation(line: 221, column: 24, scope: !1294)
!1346 = !DILocation(line: 221, column: 5, scope: !1294)
!1347 = !DILocation(line: 222, column: 24, scope: !1294)
!1348 = !DILocation(line: 222, column: 5, scope: !1294)
!1349 = !DILocation(line: 223, column: 24, scope: !1294)
!1350 = !DILocation(line: 223, column: 5, scope: !1294)
!1351 = !DILocation(line: 224, column: 24, scope: !1294)
!1352 = !DILocation(line: 224, column: 5, scope: !1294)
!1353 = !DILocation(line: 225, column: 24, scope: !1294)
!1354 = !DILocation(line: 225, column: 5, scope: !1294)
!1355 = !DILocation(line: 227, column: 2, scope: !1294)
!1356 = !DILocation(line: 229, column: 2, scope: !1294)
!1357 = !DILocation(line: 231, column: 2, scope: !1294)
!1358 = !DILocation(line: 232, column: 7, scope: !1294)
!1359 = !DILocation(line: 232, column: 5, scope: !1294)
!1360 = !DILocation(line: 233, column: 2, scope: !1294)
!1361 = !DILocation(line: 237, column: 10, scope: !1294)
!1362 = !DILocation(line: 237, column: 30, scope: !1294)
!1363 = !DILocation(line: 237, column: 46, scope: !1294)
!1364 = !DILocation(line: 237, column: 2, scope: !1294)
!1365 = !DILocation(line: 238, column: 10, scope: !1294)
!1366 = !DILocation(line: 238, column: 2, scope: !1294)
!1367 = !DILocation(line: 240, column: 22, scope: !1368)
!1368 = distinct !DILexicalBlock(scope: !1294, file: !64, line: 240, column: 5)
!1369 = !DILocation(line: 240, column: 16, scope: !1368)
!1370 = !DILocation(line: 240, column: 14, scope: !1368)
!1371 = !DILocation(line: 240, column: 41, scope: !1368)
!1372 = !DILocation(line: 240, column: 5, scope: !1294)
!1373 = !DILocation(line: 241, column: 3, scope: !1368)
!1374 = !DILocation(line: 243, column: 8, scope: !1294)
!1375 = !DILocation(line: 243, column: 15, scope: !1294)
!1376 = !DILocation(line: 243, column: 2, scope: !1294)
!1377 = !DILocation(line: 245, column: 9, scope: !1294)
!1378 = !DILocation(line: 245, column: 2, scope: !1294)
!1379 = !DILocation(line: 246, column: 1, scope: !1294)
